Catalogs/бит_бу_ШаблоныИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_бу_ШаблоныИзвещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сальдо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредит</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БиллинговаяУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцедураПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_бу_ШаблоныИзвещений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПередЗаписью". 
//
Процедура ПередЗаписью(Отказ)
	
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// БИТ_ЖКХ 14.09.2016 17:00:31 Начало правки... 
	Если ДополнительныеСвойства.Свойство("Администрирование") Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 14.09.2016 17:00:33 Конец правки. 
	
	Если Не ЭтоНовый() тогда
		Если  Наименование <> Ссылка.Наименование
			ИЛИ Сальдо <> Ссылка.Сальдо 
			ИЛИ Кредит <> Ссылка.Кредит
			ИЛИ ПолучательПлатежа <> Ссылка.ПолучательПлатежа
			Тогда
			МассивДокументов = КритерииОтбора.бит_бу_ДокументыПоШаблонуИзвещений.Найти(Ссылка);
			ЕстьПроведенныеДокументы = Ложь;
			
			Для каждого Документ из МассивДокументов Цикл
				
				ЕстьПроведенныеДокументы = Документ.Проведен;
				
				Если ЕстьПроведенныеДокументы тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьПроведенныеДокументы Тогда

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы, проведенные по шаблону извещений """ + Ссылка.Наименование + """.
				|Реквизиты ""Сальдо"", ""Кредит"", ""Получатель платежа"" не могут быть изменены.
				|Элемент не записан.");
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
